package oop.task17;

/*
Создайте класс Bank, представляющий банк, с методами для открытия счета, закрытия счета, перевода денег между
счетами и вывода баланса счета. Реализуйте классы SavingAccount и CheckingAccount, которые наследуются от BankAccount
и имеют дополнительные методы и свойства. Реализуйте также класс BankCustomer, который содержит список счетов
(BankAccount) и методы для управления счетами.
 */
public class Bank {
    // открытие счета

    // закрытие счета

    // перевод денег

    // вывод баланса
}
