public class Test {
    public static final String SIX = "0123456789abcdef";
    public static void main(String[] args) {
        String s = "Милана Койчева, Россия, г. Петропавловск-Камчатский, Космонавтов ул., д. 14 кв.102, " +
                "milana17@yandex.ru, +7 (992) 175-13-27; " +
                "Кира Деменока, Россия, г. Евпатория, Дружная ул., д. 14 кв.144, " +
                "kira4836@mail.ru, +7 (921) 952-47-99; " +
                "Жанна Ефимова, Россия, г. Омск, Речной пер., д. 10 кв.15, " +
                "janna21011996@mail.ru, +7 (962) 602-65-40";
    }


}
